app/controllers/api/tweets_controller.rb

INSERT INTO "tweets" ("user_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["body", "This is a valid tweet"], ["created_at", "2023-08-09 14:34:00.361670"], ["updated_at", "2023-08-09 14:34:00.361670"]]
---
    def create
      return head :bad_request if params[:body].blank? || params[:user_id].blank?

      @tweet = Tweet.new(
        user_id: params[:user_id],
        body: params[:body]
      )

      if @tweet.valid?
        @tweet.save